<a href="https://colab.research.google.com/github/triatebr/aprenda-python/blob/master/Pivotar_dataframe.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

In [0]:
df = pd.DataFrame({'ID': ['21678155', '21678155','21678155', '21678155','21678155', '21678155','21678154', '21678154', '21678154', '21678154','21678154','21678154'],
                   'DATE': ['01/02/2019','08/02/2019' ,'15/02/2019','22/02/2019', '25/02/2019','27/02/2019', '01/02/2019','05/02/2019','11/02/2019', '22/02/2019', '27/02/2019','28/02/2019'],
                   'CURSO': ['Tecnólogo em Gestão Financeira','Tecnólogo em Gestão Financeira', 'Tecnólogo em Gestão Financeira','Tecnólogo em Gestão Financeira', 'Tecnólogo em Gestão Financeira', 'Tecnólogo em Gestão Financeira', 'Administração de Empresas', 'Administração de Empresas', 'Administração de Empresas','Administração de Empresas', 'Administração de Empresas','Administração de Empresas'],
                   'PRECO': [221,225,250,265,290,244,348,345,356,360,385,391],
                   'DESCONTO': [217,221,244,235,221,240,342,340,350,358,379,388]})

In [3]:
df

                             CURSO        DATE  DESCONTO        ID  PRECO
0   Tecnólogo em Gestão Financeira  01/02/2019       217  21678155    221
1   Tecnólogo em Gestão Financeira  08/02/2019       221  21678155    225
2   Tecnólogo em Gestão Financeira  15/02/2019       244  21678155    250
3   Tecnólogo em Gestão Financeira  22/02/2019       235  21678155    265
4   Tecnólogo em Gestão Financeira  25/02/2019       221  21678155    290
5   Tecnólogo em Gestão Financeira  27/02/2019       240  21678155    244
6        Administração de Empresas  01/02/2019       342  21678154    348
7        Administração de Empresas  05/02/2019       340  21678154    345
8        Administração de Empresas  11/02/2019       350  21678154    356
9        Administração de Empresas  22/02/2019       358  21678154    360
10       Administração de Empresas  27/02/2019       379  21678154    385
11       Administração de Empresas  28/02/2019       388  21678154    391

In [0]:
def custom(series):
    min_date = list(series)[0]
    pen_date = list(series)[-2]
    max_date = list(series)[-1]
    
    return min_date,pen_date,max_date

In [0]:
def get_price(series):
    price_a = list(series)[0]
    price_c = list(series)[-2]
    price_b = list(series)[-1]
    
    return price_a,price_c,price_b

In [7]:
df.groupby(["ID"], as_index=False).agg({"DATE":custom,"PRECO":get_price})

         ID                                  DATE            PRECO
0  21678154  (01/02/2019, 27/02/2019, 28/02/2019)  (348, 385, 391)
1  21678155  (01/02/2019, 25/02/2019, 27/02/2019)  (221, 290, 244)

In [0]:
df.dtypes

ID          object
DATE        object
CURSO       object
PRECO        int64
DESCONTO     int64
dtype: object